# PaneIsRegistered Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DockablePane..::..PaneIsRegistered Method
DockablePane Class See Also
---
Returns true if %id% refers to a built-in Revit dockable pane, or an add-in pane that has been properly registered with %Autodesk.Revit.UI.UIApplication.RegisterDockablePane%.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static bool PaneIsRegistered(
	DockablePaneId id
)
```

Visual Basic
---
```text
Public Shared Function PaneIsRegistered ( _
	id As DockablePaneId _
) As Boolean
```

Visual C++
---
```text
public:
static bool PaneIsRegistered(
	DockablePaneId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.UI..::..DockablePaneId
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DockablePane Class
Autodesk.Revit.UI Namespace